results/4-loadtest/google_results/google_go_10.txt
Running 1m test @ https://europe-west1-double-catfish-238707.cloudfunctions.net/Go_matrix
  2 threads and 10 connections
  Thread calibration: mean lat.: 119.595ms, rate sampling interval: 467ms
  Thread calibration: mean lat.: 122.346ms, rate sampling interval: 376ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   113.46ms   70.82ms 467.97ms   84.80%
    Req/Sec     4.76      5.21    13.00     85.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   97.34ms
 75.000%  121.92ms
 90.000%  205.05ms
 99.000%  385.54ms
 99.900%  468.22ms
 99.990%  468.22ms
 99.999%  468.22ms
100.000%  468.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      33.471     0.000000            1         1.00
      55.455     0.100000           50         1.11
      66.111     0.200000          100         1.25
      75.199     0.300000          150         1.43
      86.335     0.400000          200         1.67
      97.343     0.500000          250         2.00
     102.335     0.550000          275         2.22
     107.263     0.600000          302         2.50
     111.999     0.650000          325         2.86
     117.695     0.700000          350         3.33
     121.919     0.750000          375         4.00
     126.847     0.775000          388         4.44
     131.007     0.800000          400         5.00
     142.719     0.825000          413         5.71
     153.215     0.850000          425         6.67
     166.911     0.875000          438         8.00
     182.271     0.887500          444         8.89
     205.055     0.900000          451        10.00
     216.831     0.912500          457        11.43
     226.047     0.925000          463        13.33
     245.119     0.937500          469        16.00
     256.255     0.943750          472        17.78
     266.495     0.950000          475        20.00
     294.655     0.956250          479        22.86
     311.039     0.962500          482        26.67
     321.023     0.968750          485        32.00
     329.983     0.971875          486        35.56
     343.807     0.975000          489        40.00
     350.207     0.978125          490        45.71
     359.167     0.981250          491        53.33
     372.479     0.984375          493        64.00
     372.479     0.985938          493        71.11
     381.951     0.987500          494        80.00
     385.535     0.989062          495        91.43
     403.455     0.990625          496       106.67
     433.663     0.992188          497       128.00
     433.663     0.992969          497       142.22
     433.663     0.993750          497       160.00
     434.943     0.994531          498       182.86
     434.943     0.995313          498       213.33
     449.023     0.996094          499       256.00
     449.023     0.996484          499       284.44
     449.023     0.996875          499       320.00
     449.023     0.997266          499       365.71
     449.023     0.997656          499       426.67
     468.223     0.998047          500       512.00
     468.223     1.000000          500          inf
#[Mean    =      113.457, StdDeviation   =       70.820]
#[Max     =      467.968, Total count    =          500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 1.00m, 272.80KB read
Requests/sec:     10.02
Transfer/sec:      4.54KB