results/4-loadtest/google_results/google_node_10.txt
Running 1m test @ https://europe-west1-double-catfish-238707.cloudfunctions.net/node_matrix
  2 threads and 10 connections
  Thread calibration: mean lat.: 208.879ms, rate sampling interval: 574ms
  Thread calibration: mean lat.: 107.329ms, rate sampling interval: 314ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    99.24ms   40.69ms 204.67ms   62.20%
    Req/Sec     4.78      5.85    15.00     79.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   90.11ms
 75.000%  131.46ms
 90.000%  156.03ms
 99.000%  193.02ms
 99.900%  204.80ms
 99.990%  204.80ms
 99.999%  204.80ms
100.000%  204.80ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      39.711     0.000000            1         1.00
      50.175     0.100000           50         1.11
      57.631     0.200000          100         1.25
      68.223     0.300000          150         1.43
      79.743     0.400000          200         1.67
      90.111     0.500000          250         2.00
      99.327     0.550000          275         2.22
     107.007     0.600000          300         2.50
     117.567     0.650000          325         2.86
     125.375     0.700000          350         3.33
     131.455     0.750000          375         4.00
     135.423     0.775000          388         4.44
     136.831     0.800000          400         5.00
     140.031     0.825000          414         5.71
     143.871     0.850000          425         6.67
     150.527     0.875000          438         8.00
     151.551     0.887500          444         8.89
     156.031     0.900000          450        10.00
     159.231     0.912500          457        11.43
     167.167     0.925000          464        13.33
     171.391     0.937500          469        16.00
     172.927     0.943750          472        17.78
     174.079     0.950000          475        20.00
     176.767     0.956250          479        22.86
     180.095     0.962500          482        26.67
     181.887     0.968750          485        32.00
     182.655     0.971875          486        35.56
     183.679     0.975000          488        40.00
     186.495     0.978125          490        45.71
     186.751     0.981250          491        53.33
     189.183     0.984375          493        64.00
     189.183     0.985938          493        71.11
     191.871     0.987500          494        80.00
     193.023     0.989062          495        91.43
     194.175     0.990625          496       106.67
     196.095     0.992188          497       128.00
     196.095     0.992969          497       142.22
     196.095     0.993750          497       160.00
     198.911     0.994531          498       182.86
     198.911     0.995313          498       213.33
     204.671     0.996094          499       256.00
     204.671     0.996484          499       284.44
     204.671     0.996875          499       320.00
     204.671     0.997266          499       365.71
     204.671     0.997656          499       426.67
     204.799     0.998047          500       512.00
     204.799     1.000000          500          inf
#[Mean    =       99.238, StdDeviation   =       40.686]
#[Max     =      204.672, Total count    =          500]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  602 requests in 1.00m, 319.83KB read
Requests/sec:     10.03
Transfer/sec:      5.33KB