results/4-loadtest/google_results/google_node_800.txt
Running 1m test @ https://europe-west1-double-catfish-238707.cloudfunctions.net/node_matrix
  2 threads and 800 connections
  Thread calibration: mean lat.: 1220.412ms, rate sampling interval: 4935ms
  Thread calibration: mean lat.: 1214.753ms, rate sampling interval: 5165ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   181.29ms  299.31ms   9.36s    93.46%
    Req/Sec   407.17     23.16   479.00     88.89%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  107.78ms
 75.000%  182.40ms
 90.000%  365.05ms
 99.000%    1.19s 
 99.900%    4.02s 
 99.990%    7.23s 
 99.999%    9.36s 
100.000%    9.36s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      38.047     0.000000            1         1.00
      47.967     0.100000         3912         1.11
      53.343     0.200000         7772         1.25
      62.559     0.300000        11659         1.43
      85.439     0.400000        15551         1.67
     107.775     0.500000        19434         2.00
     119.487     0.550000        21377         2.22
     132.479     0.600000        23322         2.50
     146.815     0.650000        25265         2.86
     162.175     0.700000        27217         3.33
     182.399     0.750000        29151         4.00
     196.479     0.775000        30117         4.44
     212.991     0.800000        31093         5.00
     235.647     0.825000        32062         5.71
     267.263     0.850000        33032         6.67
     311.039     0.875000        34005         8.00
     337.407     0.887500        34493         8.89
     365.055     0.900000        34977        10.00
     397.567     0.912500        35459        11.43
     439.039     0.925000        35946        13.33
     494.591     0.937500        36431        16.00
     522.751     0.943750        36674        17.78
     559.615     0.950000        36918        20.00
     606.207     0.956250        37159        22.86
     656.383     0.962500        37403        26.67
     718.847     0.968750        37645        32.00
     759.295     0.971875        37773        35.56
     783.871     0.975000        37888        40.00
     816.127     0.978125        38010        45.71
     875.007     0.981250        38131        53.33
     961.023     0.984375        38253        64.00
    1013.247     0.985938        38313        71.11
    1076.223     0.987500        38375        80.00
    1149.951     0.989062        38434        91.43
    1216.511     0.990625        38495       106.67
    1369.087     0.992188        38556       128.00
    1455.103     0.992969        38587       142.22
    1581.055     0.993750        38617       160.00
    1807.359     0.994531        38647       182.86
    2075.647     0.995313        38677       213.33
    2289.663     0.996094        38708       256.00
    2580.479     0.996484        38723       284.44
    2770.943     0.996875        38739       320.00
    2916.351     0.997266        38753       365.71
    3133.439     0.997656        38768       426.67
    3252.223     0.998047        38784       512.00
    3401.727     0.998242        38791       568.89
    3602.431     0.998437        38799       640.00
    3704.831     0.998633        38806       731.43
    3862.527     0.998828        38814       853.33
    4044.799     0.999023        38822      1024.00
    4134.911     0.999121        38825      1137.78
    4149.247     0.999219        38829      1280.00
    4222.975     0.999316        38833      1462.86
    4308.991     0.999414        38837      1706.67
    4341.759     0.999512        38841      2048.00
    4378.623     0.999561        38842      2275.56
    4403.199     0.999609        38844      2560.00
    4497.407     0.999658        38846      2925.71
    4542.463     0.999707        38848      3413.33
    5074.943     0.999756        38850      4096.00
    5079.039     0.999780        38851      4551.11
    5275.647     0.999805        38852      5120.00
    5345.279     0.999829        38853      5851.43
    6279.167     0.999854        38854      6826.67
    7225.343     0.999878        38855      8192.00
    7225.343     0.999890        38855      9102.22
    7991.295     0.999902        38856     10240.00
    7991.295     0.999915        38856     11702.86
    8740.863     0.999927        38857     13653.33
    8740.863     0.999939        38857     16384.00
    8740.863     0.999945        38857     18204.44
    8896.511     0.999951        38858     20480.00
    8896.511     0.999957        38858     23405.71
    8896.511     0.999963        38858     27306.67
    8896.511     0.999969        38858     32768.00
    8896.511     0.999973        38858     36408.89
    9363.455     0.999976        38859     40960.00
    9363.455     1.000000        38859          inf
#[Mean    =      181.292, StdDeviation   =      299.308]
#[Max     =     9355.264, Total count    =        38859]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  47160 requests in 1.00m, 24.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 83
Requests/sec:    785.94
Transfer/sec:    417.54KB